app/controllers/blog_controller.rb

    def home
        @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

    def create
        @blogpost = Blog.create(
            title: params[:title],
            content: params[:content]
        )
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Random title"], ["content", "Some content"], ["created_at", "2020-03-10 17:47:02.006023"], ["updated_at", "2020-03-10 17:47:02.006023"]]

    def destroy
        @blogs = Blog.find(params[:id]).destroy
---
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 2]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]